Repository: aakodadi/shill
Catalog: po/*.po
Languages: fr

source: Unable to retrieve configuration.
fr: Incapable de récupérer la configuration.

source: Trying to create a new one...
fr: Essayant de créer une nouvelle configuration...

source: unable to allocate memory for a string
fr: Incapable d'allouer de l'espace mémoire pour une chaîne de caractère

source: Unable to disable echoing while reading a password
fr: Incapable de désactiver l'écho pour lire un mot de passe

source: unable to perform a request to the server: %s
fr: Incapable d'effectuer une requette au serveur: %s

source: unauthorized to access posts
fr: vous n'êtes pas autorisé pour accéder aux postes

source: unauthorized to post
fr: vous n'êtes pas autorisé pour accéder à ce poste

source: invalid user information
fr: Données utilisateur non valides

source: invalid login information
fr: Données utilisateur non valides

source: %d:%d: cannot parse json content: %s
fr: %d:%d: Incapable d'analyser du contenu JSON: %s

source: cannot parse json content: expected root element to be a json object: %s
fr: Incapable d'analyser du contenu JSON: L'élément racine supposé être un objet JSON: %s

source: cannot parse json content: expected root element to be a json array: %s
fr: Incapable d'analyser du contenu JSON: élément racine supposé être un tableau JSON: %s

source: cannot parse json content: expected elements in root to be json objects: %s
fr: Incapable d'analyser du contenu JSON: Les éléments de la racine supposés être des objets JSON: %s

source: couldn't find home directory
fr: Impossible de trouver le répertoire personnel

source: cannot open configuration file: %s
fr: Impossible d'ouvrir le fichier de configuration: %s

source: cannot close configuration file: %s
fr: Impossible de fermer le fichier de configuration: %s

source: %s:%d:%d: cannot parse json file: %s
fr: %s:%d:%d: Incapable d'analyser un fichier JSON: %s

source: %s: cannot parse json file: expected root element to be a json object
fr: %s: Incapable d'analyser un fichier JSON: L'élément racine supposé être un objet JSON

source: %s: cannot parse json file: expected "configuration" element to be a json object
fr: %s: Incapable d'analyser un fichier JSON: L'élément "configuration" supposé être un objet JSON

source: %s: cannot parse json file: expected "server" element to be a json object
fr: %s: Incapable d'analyser un fichier JSON: L'élément "server" supposé être un objet JSON

source: %s: cannot parse json file: expected "base-url" element to be a json string
fr: %s: Incapable d'analyser un fichier JSON: L'élément "base-url" supposé être une chaîne de caractère JSON

source: cannot write into configuration file: %s
fr: Impossible d'écrire dans le fichier de configuration: %s

source: cannot create configuration file: %s
fr: Incapable de créer le fichier de configuration: %s

source: login required: cannot find a valid username in configuration
fr: login requis: Impossible de trouver un nom d'utilisateur valide dans la configuration

source: login required: cannot find a valid auth_token in configuration
fr: login requis: Impossible de trouver un auth_token valide dans la configuration

source: unrecognized command: %s
fr: commande non reconnu: %s

source: %s: too few arguments: missing command argument
fr: %s: trop peu d'arguments: Argument <commande> manquant

source: %s: too many arguments
fr: %s: trop d'arguments

source: Usage: %s [OPTION]... <COMMAND>
fr: Utilisation: %s [OPTION]... <COMMANDE>

source: Interact with people right form your terminal.
fr: Interagissez avec les gens depuis votre terminal.

source: -h, --help display this help and exit --usage display a short usage message and exit -v, --version display version information and exit
fr: -h, --help afficher l'aide-mémoire --usage afficher un court message d'utilisation et quitter -v, --version afficher le nom et la version du logiciel

source: -c, --config-file=PATH set configuration file (default ~/.shill_config.json) -u, --username=USERNAME set username for login --base-url=URL change base-url in configuration
fr: -c, --config-file=PATH définir le fichier de configuration (par défaut ~/.shill_config.json) -u, --username=USERNAME définir le nom d'utilisateur pour le login --base-url=URL modifier base-url dans la configuration

source: This is the list of all Shill commands. register create a new Shill account login login to a Shill account feed list posts queue post submit a new post configure perform modifications to Shill configuration
fr: Celle-ci est une liste de tout les commandes de Shill. register Créer un nouveau compte Shill login S'identifier a un compte Shill feed Lister les postes dans la file post Créer un nouveau poste configure Effectuer une modification de la configuration Shill

source: Report bugs to: %s
fr: Rapporter toutes anomalies à: %s

source: Report %s bugs to: %s
fr: Rapporter toutes anomalies de %s à: %s

source: %s home page: <%s>
fr: Page d'accueil de %s: <%s>

source: %s home page: <http://www.gnu.org/software/%s/>
fr: Page d'accueil de %s: <http://www.gnu.org/software/%s/>

source: General help using GNU software: <http://www.gnu.org/gethelp/>
fr: Aide générale à l'utilisation du logiciel GNU: <http://www.gnu.org/gethelp/>

source: Copyright (C) %d Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html> This is free software: you are free to change and redistribute it. There is NO WARRANTY, to the extent permitted by law.
fr: Copyright © %d Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html> Ce logiciel est libre: vous êtes libre de le changer et de le redistribuer. AUCUNE garantie n'est donnée; dans la mesure permise par la loi.
